using System;
class Program
{
    static void Main()
    {
        int size = 9; // Встановлюємо розмір поля 9х9 (або якщо 10х10 викорстати метод  Console.Write((size - i).ToString().PadLeft(2) + " ");)
        string letters = "ABCDEFGHI"; // Букви для підпису стовпців знизу поля
        int shipCells = 0; // Лічильник клітинок з кораблями. 



            // Крок 1: Створити двовимірний масив field розміром size x size

            // Крок 2: Заповнити всі клітинки символом "~" (вода) — два вкладені цикли for

            // Крок 3: Розмістити горизонтальний корабель з 4 клітинок у рядку 2 (індекс 8) — цикл for по j від 1 до 4

            // Крок 4: Розмістити вертикальний корабель з 3 клітинок у стовпці H (індекс 7) — цикл for по i від 2 до 4

            // Крок 5: Поставити два однопалубні кораблі вручну — два рядки field[i, j] = "x"

            // Крок 6: Вивести поле — два вкладені цикли for, нумерація рядків зліва від 10 до 1
            //         всередині рахувати shipCells якщо клітинка == "x"

            // Крок 7: Вивести букви A–J знизу — foreach по рядку letters 

            // Крок 8: Вивести підсумок — кількість клітинок з кораблями
        
    }
}